Repository: JiangNanGenius/floe-agent
Catalog: FloeAgent/FloeApp/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# chat.conversation_list_view.action_failed
source: Action failed
zh_hans: 操作失败

# chat.conversation_list_view.all_tasks_in_the_archive_and
source: All tasks in the archive and their private data will be permanently deleted.
zh_hans: 归档区内的所有任务及其私有数据将被永久删除。

# chat.conversation_list_view.archive
source: Archive
zh_hans: 归档区

# chat.conversation_list_view.archive_selection
source: Archive selection
zh_hans: 归档所选

# chat.conversation_list_view.clear
source: Clear
zh_hans: 清空

# chat.conversation_list_view.clear_the_archive
source: Clear the archive?
zh_hans: 清空归档区？

# chat.conversation_list_view.delete_the_selected_tasks
source: Delete the selected tasks?
zh_hans: 删除所选任务？

# chat.conversation_list_view.permanently_delete_the_selected_tasks
source: Permanently delete the selected tasks?
zh_hans: 永久删除所选任务？

# chat.conversation_list_view.permanently_delete_this_task
source: Permanently delete this task?
zh_hans: 永久删除这个任务？

# chat.conversation_list_view.the_archive_is_empty
source: The archive is empty
zh_hans: 归档区为空

# chat.conversation_list_view.the_task_generated_content_private_workspace
source: The task, generated content, private workspace and attachment references will be permanently deleted; Floe-hosted cloud workspaces are also cleaned up and enter a pending queue while offline.
zh_hans: 任务、生成内容、私有工作区和附件引用将被永久删除；Floe 托管的云工作区也会清理，离线时进入待处理队列。

# chat.conversation_list_view.the_task_generated_content_private_workspace_2
source: The task, generated content, private workspace and attachment references will be permanently deleted.
zh_hans: 任务、生成内容、私有工作区和附件引用将被永久删除。

# chat.conversation_list_view.the_task_private_workspace_and_temporary
source: The task, private workspace and temporary credentials will be deleted; cloud workspaces created by Floe are cleaned up immediately, or queued for automatic cleanup while offline. This cannot be undone.
zh_hans: 任务、私有工作区和临时凭据将被删除；由 Floe 创建的云工作区会立即清理，离线时会排队后自动清理。此操作不可撤销。

# chat.conversation_search_view.no_matching_messages_found
source: No matching messages found
zh_hans: 没有找到匹配的消息

# chat.conversation_search_view.result
source: Result
zh_hans: 结果

# chat.conversation_search_view.search_conversations
source: Search conversations…
zh_hans: 搜索对话内容…

# chat.new
source: New Conversation
zh_hans: 新建对话

# chat.open.hint
source: Opens the conversation thread
zh_hans: 打开对话线程

# chat.reasoning_block_view.back_to_top
source: Back to top
zh_hans: 回到开头

# chat.reasoning_block_view.full_reasoning
source: Full reasoning
zh_hans: 思考全文

# chat.reasoning_block_view.latest_content
source: Latest content
zh_hans: 最新内容

# chat.reasoning_block_view.read_full_screen
source: Read Full Screen
zh_hans: 全屏阅读

# chat.reasoning_block_view.thinking
source: Thinking…
zh_hans: 正在思考…

# chat.reasoning_block_view.thinking_is_still_updating
source: Thinking is still updating
zh_hans: 思考内容持续更新中

# chat.reasoning_block_view.to_end
source: To end
zh_hans: 到结尾

# chat.reasoning_block_view.view_thinking_record
source: View thinking record
zh_hans: 查看思考记录

# chat.reasoning_block_view.waiting_for_the_model
source: Waiting for the model
zh_hans: 等待模型响应

# chat.rich_artifact_view.artifact_verification_failed
source: Artifact verification failed
zh_hans: 产物校验失败

# chat.rich_artifact_view.category
source: Category
zh_hans: 类别

# chat.rich_artifact_view.could_not_read_the_artifact
source: Could not read the artifact
zh_hans: 无法读取产物

# chat.rich_artifact_view.expand_interactive_preview
source: Expand interactive preview
zh_hans: 展开交互预览

# chat.rich_artifact_view.interactive_preview
source: Interactive preview
zh_hans: 交互预览

# chat.rich_artifact_view.series
source: Series
zh_hans: 系列

# chat.rich_artifact_view.share
source: Share
zh_hans: 分享

# chat.rich_artifact_view.share_chart_data
source: Share chart data
zh_hans: 分享图表数据

# chat.rich_artifact_view.share_table_data
source: Share table data
zh_hans: 分享表格数据

# chat.rich_artifact_view.the_artifact_passed_verification_but_its
source: The artifact passed verification but its structure cannot be parsed
zh_hans: 产物已校验，但结构无法解析

# chat.rich_artifact_view.the_artifact_path_or_size_is
source: The artifact path or size is not supported
zh_hans: 产物路径或大小不受支持

# chat.rich_artifact_view.value
source: Value
zh_hans: 值

# chat.run_state_localizer.compacting_context
source: Compacting context
zh_hans: 正在压缩上下文

# chat.run_state_localizer.output_unfinished_you_can_continue
source: Output unfinished; you can continue
zh_hans: 输出未完成，可继续

# chat.run_state_localizer.task_blocked_action_needed
source: Task blocked, action needed
zh_hans: 任务受阻，需处理

# chat.run_state_localizer.task_unfinished_you_can_continue
source: Task unfinished; you can continue
zh_hans: 任务未完成，可继续

# chat.run_state_localizer.the_approval_model_is_reviewing
source: The approval model is reviewing…
zh_hans: 审批模型正在审核…

# chat.run_state_localizer.the_set_budget_was_reached_you
source: The set budget was reached; you can continue
zh_hans: 已达到所设预算，可继续

# chat.run_state_localizer.waiting_for_your_input
source: Waiting for your input
zh_hans: 等待你的输入

# chat.search.no_results
source: No Results
zh_hans: 无结果

# chat.search.prompt
source: Search conversations
zh_hans: 搜索对话

# chat.select_or_new
source: Select a conversation, or start a new one.
zh_hans: 选择一个对话，或新建对话。

# chat.step_group_view.auto_approved
source: Auto-approved
zh_hans: 已自动批准

# chat.step_group_view.collapsed
source: Collapsed
zh_hans: 已折叠

# chat.step_group_view.expand
source: Expand
zh_hans: 展开

# chat.step_group_view.expanded
source: Expanded
zh_hans: 已展开

# chat.step_group_view.items_need_review
source: %@ items need review
zh_hans: %@ 项需要查看

# chat.step_group_view.items_need_review.one
source: %@ item needs review
zh_hans: %@ 项需要查看

# chat.step_group_view.items_running
source: %@ items running
zh_hans: %@ 项运行中

# chat.step_group_view.items_running.one
source: %@ item running
zh_hans: %@ 项运行中

# chat.step_group_view.run_records
source: Run records
zh_hans: 执行记录

# chat.step_group_view.thinking_segments
source: %@ thinking segments
zh_hans: %@ 段思考

# chat.step_group_view.thinking_segments.one
source: %@ thinking segment
zh_hans: %@ 段思考

# chat.step_group_view.tool_calls
source: %@ tool calls
zh_hans: %@ 个工具调用

# chat.step_group_view.tool_calls.one
source: %@ tool call
zh_hans: %@ 个工具调用

# chat.step_group_view.view_run_records
source: View run records
zh_hans: 查看执行记录

# chat.step_group_view.waiting_for_confirmation
source: Waiting for confirmation
zh_hans: 等待确认

# chat.thread_composer_view.add_to_message_queue
source: Add to message queue
zh_hans: 加入消息队列

# chat.thread_composer_view.agent_mode
source: Agent mode
zh_hans: Agent 模式

# chat.thread_composer_view.allow_calling_authorized_tools
source: Allow calling authorized tools
zh_hans: 允许调用已授权工具

# chat.thread_composer_view.chat_mode
source: Chat mode
zh_hans: 聊天模式

# chat.thread_composer_view.compact_context
source: Compact context
zh_hans: 压缩上下文

# chat.thread_composer_view.compact_this_conversation_s_history_before
source: Compact this conversation's history before the next model request
zh_hans: 下次模型请求前压缩当前会话历史

# chat.thread_composer_view.could_not_process_the_captured_photo
source: Could not process the captured photo.
zh_hans: 无法处理拍摄的照片。

# chat.thread_composer_view.finishing_transcription
source: Finishing transcription…
zh_hans: 正在完成转写…

# chat.thread_composer_view.goal_mode
source: Goal mode
zh_hans: 目标模式

# chat.thread_composer_view.import_attachment
source: Import attachment
zh_hans: 导入附件

# chat.thread_composer_view.import_camera_photo
source: Import camera photo
zh_hans: 导入相机照片

# chat.thread_composer_view.keeps_executing_until_the_acceptance_criteria
source: Keeps executing until the acceptance criteria are met
zh_hans: 持续执行到满足验收条件

# chat.thread_composer_view.listening
source: Listening…
zh_hans: 正在聆听…

# chat.thread_composer_view.listening_to_you
source: Listening to you
zh_hans: 正在听你说话

# chat.thread_composer_view.manage_skills
source: Manage skills
zh_hans: 管理 Skills

# chat.thread_composer_view.no_tool_calls
source: No tool calls
zh_hans: 不调用工具

# chat.thread_composer_view.notes_sources
source: Notes Sources
zh_hans: 手记资料

# chat.thread_composer_view.open_installed_skills_and_permissions
source: Open installed skills and permissions
zh_hans: 打开已安装 Skill 与权限

# chat.thread_composer_view.open_workspace
source: Open workspace
zh_hans: 打开工作区

# chat.thread_composer_view.plan_mode
source: Plan mode
zh_hans: 计划模式

# chat.thread_composer_view.please_wait
source: Please wait…
zh_hans: 请稍候…

# chat.thread_composer_view.preparing_speech_recognition
source: Preparing speech recognition…
zh_hans: 正在准备语音识别…

# chat.thread_composer_view.queue
source: Queue
zh_hans: 排队

# chat.thread_composer_view.read_only_analysis_that_produces_a
source: Read-only analysis that produces a plan
zh_hans: 只读分析并生成计划

# chat.thread_composer_view.requesting_microphone_permission
source: Requesting microphone permission…
zh_hans: 正在请求语音权限…

# chat.thread_composer_view.save_model_settings
source: Save model settings
zh_hans: 保存模型设置

# chat.thread_composer_view.send_method_while_running
source: Send method while running
zh_hans: 运行中发送方式

# chat.thread_composer_view.specify_in_next_request
source: Specify $%@ in the next request
zh_hans: 在下一条请求中指定 $%@

# chat.thread_composer_view.steer
source: Steer
zh_hans: 引导

# chat.thread_composer_view.steer_the_current_run
source: Steer the current run
zh_hans: 引导当前运行

# chat.thread_composer_view.switched_to
source: Switched to %@.
zh_hans: 已切换到%@。

# chat.thread_detail_view.acceptance_criteria_one_per_line
source: Acceptance criteria (one per line)
zh_hans: 验收标准（每行一条）

# chat.thread_detail_view.all_files
source: All Files
zh_hans: 全部文件

# chat.thread_detail_view.assistant
source: Assistant
zh_hans: 助手

# chat.thread_detail_view.blocking_conditions_one_per_line
source: Blocking conditions (one per line)
zh_hans: 阻断条件（每行一条）

# chat.thread_detail_view.cancelled
source: Cancelled
zh_hans: 已取消

# chat.thread_detail_view.changes
source: Changes
zh_hans: 变更

# chat.thread_detail_view.context_reuse
source: Context reuse %@
zh_hans: 上下文复用 %@

# chat.thread_detail_view.context_reuse_rate
source: Context reuse rate %@
zh_hans: 上下文复用率 %@

# chat.thread_detail_view.context_window
source: Context window
zh_hans: 上下文窗口

# chat.thread_detail_view.continue
source: Continue
zh_hans: 继续

# chat.thread_detail_view.convert_to_goal
source: Convert to Goal
zh_hans: 转为 Goal

# chat.thread_detail_view.convert_to_steer
source: Convert to steer
zh_hans: 转为引导

# chat.thread_detail_view.converting_to_steer
source: Converting to steer
zh_hans: 正在转为引导

# chat.thread_detail_view.copy_path
source: Copy Path
zh_hans: 复制路径

# chat.thread_detail_view.create_and_start
source: Create and start
zh_hans: 创建并开始

# chat.thread_detail_view.current
source: Current: %@
zh_hans: 当前：%@

# chat.thread_detail_view.dismiss_error
source: Dismiss error
zh_hans: 关闭错误

# chat.thread_detail_view.edit_queue_message
source: Edit queue message
zh_hans: 编辑队列消息

# chat.thread_detail_view.execute_on_the_normal_plan
source: Execute on the normal plan
zh_hans: 按普通计划执行

# chat.thread_detail_view.export_conversation_markdown
source: Export conversation (Markdown)
zh_hans: 导出对话（Markdown）

# chat.thread_detail_view.export_conversation_text
source: Export conversation (text)
zh_hans: 导出对话（文本）

# chat.thread_detail_view.export_full_task_including_tool_results
source: Export full task (including tool results)
zh_hans: 导出完整任务（含工具结果）

# chat.thread_detail_view.exporting
source: Exporting…
zh_hans: 正在导出…

# chat.thread_detail_view.final_goal
source: Final goal
zh_hans: 最终目标

# chat.thread_detail_view.first_response
source: First response %@
zh_hans: 开始响应 %@

# chat.thread_detail_view.generation_speed
source: Generation speed %@
zh_hans: 生成速度 %@

# chat.thread_detail_view.hide_inspector
source: Hide Inspector
zh_hans: 收起检查器

# chat.thread_detail_view.jump_to_latest
source: Jump to latest
zh_hans: 回到最新消息

# chat.thread_detail_view.key_files
source: Key files
zh_hans: 本轮重点文件

# chat.thread_detail_view.live_estimate
source: Live estimate
zh_hans: 实时估算

# chat.thread_detail_view.load_earlier_messages
source: Load earlier messages
zh_hans: 加载更早消息

# chat.thread_detail_view.load_thirty_more_older_messages_each
source: Load thirty more older messages each time
zh_hans: 每次加载更早的三十条消息

# chat.thread_detail_view.message_queue
source: Message queue
zh_hans: 消息队列

# chat.thread_detail_view.move_down
source: Move down
zh_hans: 下移

# chat.thread_detail_view.move_up
source: Move up
zh_hans: 上移

# chat.thread_detail_view.open
source: Open
zh_hans: 打开

# chat.thread_detail_view.progress
source: Progress
zh_hans: 进度

# chat.thread_detail_view.queue_message
source: Queue message
zh_hans: 队列消息

# chat.thread_detail_view.queue_message_action
source: Queue message action
zh_hans: 队列消息操作

# chat.thread_detail_view.reasoning_usage
source: Reasoning usage %@
zh_hans: 思考用量 %@

# chat.thread_detail_view.recommend_normal_execution
source: Recommend normal execution
zh_hans: 建议普通执行

# chat.thread_detail_view.refresh_media_task_status
source: Refresh media task status
zh_hans: 刷新媒体任务状态

# chat.thread_detail_view.refreshing_media_tasks
source: Refreshing media tasks…
zh_hans: 正在刷新媒体任务…

# chat.thread_detail_view.scroll_to_the_latest_message_in
source: Scroll to the latest message in the conversation
zh_hans: 滚动到对话的最新消息

# chat.thread_detail_view.sent
source: Sent
zh_hans: 已发送

# chat.thread_detail_view.set_goal
source: Set Goal
zh_hans: 设置 Goal

# chat.thread_detail_view.set_goal_directly
source: Set Goal directly
zh_hans: 直接设置 Goal

# chat.thread_detail_view.show_earlier_tool_activity
source: Show earlier tool activity
zh_hans: 查看更早的工具记录

# chat.thread_detail_view.stop_conditions_one_per_line
source: Stop conditions (one per line)
zh_hans: 停止条件（每行一条）

# chat.thread_detail_view.subagents
source: Subagents
zh_hans: 子 Agent

# chat.thread_detail_view.suggest_converting_to_goal
source: Suggest converting to Goal
zh_hans: 建议转为 Goal

# chat.thread_detail_view.terminal_host
source: Terminal / Host
zh_hans: 终端/主机

# chat.thread_detail_view.this_turn_input_output
source: This turn input %@ · output %@
zh_hans: 本轮输入 %@ · 输出 %@

# chat.thread_detail_view.total
source: Total %@
zh_hans: 合计 %@

# chat.thread_detail_view.view_context_usage
source: View context usage
zh_hans: 查看上下文用量

# chat.thread_detail_view.wait_for_the_current_run_to
source: Wait for the current run to finish
zh_hans: 等待当前运行结束

# chat.thread_detail_view.waiting_for_a_safe_insertion_point
source: Waiting for a safe insertion point
zh_hans: 等待安全插入点

# chat.thread_detail_view_model.advance_goal
source: Advance goal
zh_hans: 推进目标

# chat.thread_detail_view_model.auto_compacting_context
source: Auto-compacting context…
zh_hans: 正在自动压缩上下文…

# chat.thread_detail_view_model.choose_an_available_model_first_and
source: Choose an available model first and wait for the current run to finish
zh_hans: 请先选择可用模型，并等待当前运行结束

# chat.thread_detail_view_model.compacting_context
source: Compacting context…
zh_hans: 正在压缩上下文…

# chat.thread_detail_view_model.compaction_did_not_finish
source: Compaction did not finish: %@
zh_hans: 压缩未完成：%@

# chat.thread_detail_view_model.context_compacted_about_tokens
source: Context compacted: about %@ → %@ tokens.
zh_hans: 上下文已压缩：约 %@ → %@ tokens。

# chat.thread_detail_view_model.continues_the_original_task_and_message
source: Continues the original task and message without creating a duplicate; completed tool steps are reused.
zh_hans: 继续原任务和原消息，不会新建重复任务；已经完成的工具步骤会被复用。

# chat.thread_detail_view_model.edit
source: Edit
zh_hans: 编辑

# chat.thread_detail_view_model.export_did_not_finish
source: Export did not finish: %@
zh_hans: 导出未完成：%@

# chat.thread_detail_view_model.failed_to_read_task_data_choose
source: Failed to read task data. Choose the attachment again or reopen the task; the failure stage was recorded in the diagnostic logs (%@).
zh_hans: 读取任务数据失败。请重新选择附件或重新打开任务；诊断日志已记录失败阶段（%@）。

# chat.thread_detail_view_model.media_task_status_is_temporarily_unavailable
source: Media task status is temporarily unavailable; try again later.
zh_hans: 媒体任务状态暂时无法读取，请稍后重试。

# chat.thread_detail_view_model.new
source: New
zh_hans: 新建

# chat.thread_detail_view_model.some_media_task_statuses_could_not
source: Some media task statuses could not be updated temporarily: %@
zh_hans: 部分媒体任务状态暂时无法更新：%@

# chat.thread_detail_view_model.steps_acceptance_evidence_or_checklist_items
source: Steps, acceptance evidence or checklist items remain, so Goal will not finish early
zh_hans: 仍有步骤、验收证据或检查项未完成，Goal 不会提前结束

# chat.thread_detail_view_model.task_failed_you_can_continue_from
source: Task failed; you can continue from the checkpoint
zh_hans: 任务失败，可从检查点继续

# chat.thread_detail_view_model.task_interrupted
source: Task interrupted
zh_hans: 任务被中断

# chat.thread_detail_view_model.the_auto_approval_model_is_temporarily
source: The auto-approval model is temporarily unavailable or timed out. Safe read actions continue under local rules; retry sensitive actions or confirm them manually.
zh_hans: 自动审批模型暂时不可用或响应超时。安全读操作会按本地规则继续；敏感操作请重试或手动确认。

# chat.thread_detail_view_model.the_compaction_check_finished_without_replacing
source: The compaction check finished without replacing history this time.
zh_hans: 压缩检查结束，本次未替换历史。

# chat.thread_detail_view_model.the_goal_was_verified_with_inspectable
source: The goal was verified with inspectable evidence
zh_hans: 目标已通过可检查证据验证

# chat.thread_detail_view_model.the_plan_still_needs_revision_and
source: The plan still needs revision and can run only after it is complete
zh_hans: 计划仍需修订，完成后才能执行

# chat.thread_detail_view_model.the_sync_service_is_temporarily_unavailable
source: The sync service is temporarily unavailable; data on this device still works and retries happen automatically later.
zh_hans: 同步服务暂时不可用，本机数据仍可继续使用。稍后会自动重试。

# chat.thread_detail_view_model.verified
source: - %@ (verified: %@)
zh_hans: - %@（验证：%@）

# chat.thread_detail_view_model.view
source: View
zh_hans: 查看

# chat.thread_event_view.auto_approved
source: Auto-approved: %@
zh_hans: 已自动批准：%@

# chat.tool_call_card_view.double_tap_for_full_screen
source: Double-tap for full screen
zh_hans: 双击全屏查看

# chat.tool_call_card_view.generated_images
source: Generated images
zh_hans: 生成的图片

# chat.tool_call_card_view.save_or_share_image
source: Save or share image
zh_hans: 保存或共享图片

# chat.tool_call_card_view.the_generated_image_returned_but_local
source: The generated image returned, but local file verification failed
zh_hans: 生成图片已返回，但本地文件校验失败

# chat.tool_call_card_view.view_call_arguments_results_and_approval
source: View call arguments, results and approval records
zh_hans: 查看调用参数、结果和审批记录

# chat.untitled
source: Untitled conversation
zh_hans: 未命名对话

# chat.user_message_bubble.saved_securely_this_task_can_reference
source: Saved securely; this task can reference it by purpose
zh_hans: 已安全保存，可由本任务按用途引用

# chat.user_message_bubble.secure_credentials
source: Secure credentials
zh_hans: 安全凭据

# chat.user_message_bubble.secure_credentials_card
source: Secure credentials card
zh_hans: 安全凭据卡

# codeblock.language
source: Code language
zh_hans: 代码语言

# common.close
source: Close
zh_hans: 关闭

# common.unknown_error
source: Unknown error
zh_hans: 未知错误

# composer.attach
source: Attach
zh_hans: 附加

# composer.attachment.camera
source: Take Photo
zh_hans: 拍摄照片

# composer.attachment.files
source: Choose from Files
zh_hans: 从文件中选择

# composer.attachment.photo_failed
source: The selected photo could not be imported. Choose it again or use Files.
zh_hans: 无法从相册读取所选图片，请重新选择，或使用“从文件中选择”。

# composer.attachment.photo_library
source: Choose from Photos
zh_hans: 从照片中选择

# composer.attachment.photo_unreadable
source: The selected photo could not be read.
zh_hans: 无法读取所选照片

# composer.attachment.remove
source: Remove attachment
zh_hans: 移除附件

# composer.draft.retry
source: Retry
zh_hans: 重试

# composer.draft.save_failed
source: Draft not saved: %@
zh_hans: 草稿暂时无法保存：%@

# composer.editor.characters
source: characters
zh_hans: 字符

# composer.editor.find
source: Find
zh_hans: 查找

# composer.editor.redo
source: Redo
zh_hans: 重做

# composer.editor.select_all
source: Select All
zh_hans: 全选

# composer.editor.send
source: Send
zh_hans: 发送

# composer.editor.title
source: Edit Message
zh_hans: 编辑消息

# composer.editor.token_estimate
source: ≈ %d tokens (estimated)
zh_hans: 约 %d token（估算）

# composer.editor.undo
source: Undo
zh_hans: 撤销

# composer.expand_editor
source: Expand
zh_hans: 展开编辑

# composer.local.confirm.continue
source: Continue with %@
zh_hans: 继续切换到 %@

# composer.local.confirm.message.apple
source: The Apple system model currently supports text chat and Apple device capabilities only. Attached images are first summarized by your configured image-assist model; when none is available, the system's image text recognition is used and its limits are stated. Floe tools such as web, Python, browser, SSH, cloud workspaces and Git are unavailable with this model.
zh_hans: Apple 系统模型目前只支持文字聊天和 Apple 设备能力。附图会先由已配置的辅助读图模型生成图片摘要；没有可用辅助模型时使用系统的图片文字识别，并明确说明限制。此模型下不能使用网页、Python、浏览器、SSH、云工作区、Git 等 Floe 工具。

# composer.local.confirm.message.mlx
source: On-device models work with text only and cannot see images on their own. Attached images are first summarized by your configured image-assist model; when none is available, the system's image text recognition is used and its limits are stated. They suit search, reading files, PDF text and local computation.
zh_hans: 本机模型只处理文字，本身不识别图片。发送的图片会先由已配置的辅助读图模型生成图片摘要；没有可用辅助模型时，会使用系统的图片文字识别，并说明可识别的范围。它适合搜索、读取文件、处理 PDF 文字和本地计算。

# composer.local.confirm.title
source: Switch to an on-device model?
zh_hans: 切换到本机模型？

# composer.local.switch.confirm
source: Switch to %@
zh_hans: 切换到 %@

# composer.local.switch.message
source: %@ is currently loaded. Next time you use an on-device model it will be released first and %@ will load; running tasks are not interrupted.
zh_hans: 当前已加载 %@。下次使用本机模型时会先释放它，再加载 %@；正在执行的任务不会被中断。

# composer.mode.agent
source: Agent
zh_hans: 智能体

# composer.mode.chat
source: Chat only
zh_hans: 仅对话

# composer.mode.goal
source: Goal
zh_hans: 目标

# composer.mode.plan
source: Plan
zh_hans: 计划

# composer.model.group.apple
source: Apple system model
zh_hans: Apple 系统模型

# composer.model.group.cloud_prefix
source: Cloud
zh_hans: 云端

# composer.model.group.on_device
source: On-device models
zh_hans: 本机模型

# composer.model.group.unknown_provider
source: Unknown provider
zh_hans: 未知供应商

# composer.model.persist_failed
source: Switched to %@, but the default model could not be saved.
zh_hans: 已切换到 %@，但默认模型未能保存。

# composer.no_model
source: No model configured
zh_hans: 未配置模型

# composer.op.error.failed
source: %@ failed: %@
zh_hans: %@失败：%@

# composer.op.error.reference_failed
source: %@ failed: the file reference is stale or unreadable. Please choose the file again.
zh_hans: %@失败：文件引用已失效或内容不可读，请重新选择该文件。

# composer.op.load_local_model
source: Loading the local model
zh_hans: 加载本机模型

# composer.op.switch_local_model
source: Switching the local model
zh_hans: 切换本机模型

# composer.project.manage
source: Manage workspaces…
zh_hans: 管理工作区…

# composer.project.none
source: No project
zh_hans: 无项目

# composer.target.local
source: This device
zh_hans: 本机

# connectors.connected
source: Connected
zh_hans: 已连接

# connectors.footer
source: Connectors provide tools as needed for a task. Models, Apple permissions and SSH/VNC hosts remain in Settings.
zh_hans: 连接器按任务需要提供工具。模型、Apple 权限和 SSH/VNC 主机仍在设置中管理。

# connectors.github.disconnected
source: Not connected · Sign in to manage repository access
zh_hans: 未连接 · 登录并管理仓库授权

# connectors.manage
source: Manage connectors
zh_hans: 管理连接器

# connectors.mcp.enabled_count
source: %ld servers enabled
zh_hans: 已启用 %ld 个服务器

# connectors.mcp.title
source: Standard MCP
zh_hans: 标准 MCP

# connectors.services
source: External services
zh_hans: 外部服务
